TestServicesSoap/src/test/resources/soap/fileCalculadora.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tem="http://tempuri.org/">
    <soapenv:Header/>
    <soapenv:Body>
        <tem:Multiply>
            <tem:intA>%d</tem:intA>
            <tem:intB>%d</tem:intB>
        </tem:Multiply>
    </soapenv:Body>
</soapenv:Envelope>