SOAPRequests/CalculatorRequest.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:gs="http://tempuri.org/">
    <soapenv:Header/>
    <soapenv:Body>
        <gs:Add>
            <gs:intA>1</gs:intA>
            <gs:intB>2</gs:intB>
        </gs:Add>
    </soapenv:Body>
</soapenv:Envelope>