SoapApiClient/AddRequest.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tem="http://tempuri.org/">
	<soapenv:Header/>
	<soapenv:Body>
		<tem:Add>
			<tem:intA>{Score1}</tem:intA>
			<tem:intB>{Score2}</tem:intB>
		</tem:Add>
	</soapenv:Body>
</soapenv:Envelope>
