src/test/resources/add.xml

<Envelope xmlns="http://schemas.xmlsoap.org/soap/envelope/">
    <Body>
        <Add xmlns="http://tempuri.org/">
            <intA>[int]</intA>
            <intB>[int]</intB>
        </Add>
    </Body>
</Envelope>